---
kind: method
id: M:Autodesk.Revit.DB.FamilyInstance.GetSubComponentIds
zh: 族实例
source: html/be37702c-1dcd-bc14-aa35-45f06f20210a.htm
---
# Autodesk.Revit.DB.FamilyInstance.GetSubComponentIds Method

**中文**: 族实例

Gets the sub component ElementIds of the current family instance.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetSubComponentIds()
```

## Returns
The subcomponent ElementIDs